app/views/trattamentos/index.html.erb


  $("tr").each(function() {
    console.log("faccio");



            for (var i = 0; i < trattamenti_operazioni.length; i++)
            {

              for (var k = 0; k < operazioni.length; k++)
              {
                if(trattamenti_operazioni[i].id_operazione==operazioni[k].id && trattamenti_operazioni[i].id_trattamento==$(this).find('#ID').text() )
                {
                $(this).find('#operazioni').append(' ' + operazioni[k].nome +', ');
                }
              }
            }



              for (var i = 0; i < trattamenti_prodotti.length; i++)
              {
---
SELECT `trattamentos`.* FROM `trattamentos`