app/controllers/attrezzos_controller.rb

  def index
    @attrezzos = Attrezzo.all
---
SELECT `attrezzos`.* FROM `attrezzos`

  def create
    @attrezzo = Attrezzo.new(attrezzo_params)

    respond_to do |format|
      if @attrezzo.save
---
INSERT INTO `attrezzos` (`nome`, `descrizione`, `costo_carburante`, `deperimento`, `created_at`, `updated_at`) VALUES ('Fresa', 'fresa n6', 4.0, 3.0, '2018-01-18 08:28:10', '2018-01-18 08:28:10')

    def set_attrezzo
      @attrezzo = Attrezzo.find(params[:id])
---
SELECT  `attrezzos`.* FROM `attrezzos` WHERE `attrezzos`.`id` = 1 LIMIT 1