app/controllers/caricos_controller.rb

  def index
    @caricos = Carico.all
---
SELECT `caricos`.* FROM `caricos`