app/controllers/cat_prodottos_controller.rb

  def index
    @cat_prodottos = CatProdotto.all
---
SELECT `cat_prodottos`.* FROM `cat_prodottos`

  def create
    @cat_prodotto = CatProdotto.new(cat_prodotto_params)

    respond_to do |format|
      if @cat_prodotto.save
---
INSERT INTO `cat_prodottos` (`nome`, `descrizione`, `id_prarent`, `created_at`, `updated_at`) VALUES ('Pesticidi', 'fdsafasd', 0, '2018-01-19 18:05:44', '2018-01-19 18:05:44')

    def set_cat_prodotto
      @cat_prodotto = CatProdotto.find(params[:id])
---
SELECT  `cat_prodottos`.* FROM `cat_prodottos` WHERE `cat_prodottos`.`id` = 1 LIMIT 1