app/controllers/cat_coltures_controller.rb

SELECT `cat_coltures`.* FROM `cat_coltures`
---
  def index
    @cat_coltures = CatColture.all

INSERT INTO `cat_coltures` (`nome`, `descrizione`, `id_parent`, `created_at`, `updated_at`) VALUES ('Pere', 'Pere Generiche', 0, '2018-01-18 08:21:23', '2018-01-18 08:21:23')
---
  def create
    @cat_colture = CatColture.new(cat_colture_params)

    respond_to do |format|
      if @cat_colture.save

SELECT  `cat_coltures`.* FROM `cat_coltures` WHERE `cat_coltures`.`id` = 1 LIMIT 1
---
    def set_cat_colture
      @cat_colture = CatColture.find(params[:id])