app/controllers/colturas_controller.rb

  def index
    @colturas = Coltura.all
---
SELECT `colturas`.* FROM `colturas`

  def create
    @coltura = Coltura.new(coltura_params)

    respond_to do |format|
      if @coltura.save
---
INSERT INTO `colturas` (`nome`, `estensione_ha`, `id_cat`, `created_at`, `updated_at`) VALUES ('Pere Williams', 4.0, 1, '2018-01-18 08:21:41', '2018-01-18 08:21:41')

    def set_coltura
      @coltura = Coltura.find(params[:id])
---
SELECT  `colturas`.* FROM `colturas` WHERE `colturas`.`id` = 1 LIMIT 1