app/controllers/operazione_trattamentos_controller.rb

  def index
    @operazione_trattamentos = OperazioneTrattamento.all
---
SELECT `operazione_trattamentos`.* FROM `operazione_trattamentos`

  def create
    @operazione_trattamento = OperazioneTrattamento.new(operazione_trattamento_params)

    respond_to do |format|
      if @operazione_trattamento.save
---
INSERT INTO `operazione_trattamentos` (`id_operazione`, `id_trattamento`, `created_at`, `updated_at`) VALUES (1, 4, '2018-01-20 01:39:22', '2018-01-20 01:39:22')

  def destroy
    @operazione_trattamento.destroy
---
DELETE FROM `operazione_trattamentos` WHERE `operazione_trattamentos`.`id` = 5

    def set_operazione_trattamento
      @operazione_trattamento = OperazioneTrattamento.find(params[:id])
---
SELECT  `operazione_trattamentos`.* FROM `operazione_trattamentos` WHERE `operazione_trattamentos`.`id` = 5 LIMIT 1