app/controllers/operaziones_controller.rb

  def index
    @operaziones = Operazione.all
---
SELECT `operaziones`.* FROM `operaziones`

  def create
    @operazione = Operazione.new(operazione_params)

    respond_to do |format|
      if @operazione.save
---
INSERT INTO `operaziones` (`nome`, `descrizione`, `per_ha`, `created_at`, `updated_at`) VALUES ('Concimazione', 'Concimazione', 3.0, '2018-01-18 11:27:59', '2018-01-18 11:27:59')

    def set_operazione
      @operazione = Operazione.find(params[:id])
---
SELECT  `operaziones`.* FROM `operaziones` WHERE `operaziones`.`id` = 1 LIMIT 1