app/controllers/prodottos_controller.rb

SELECT `prodottos`.* FROM `prodottos`
---
  def index
    @prodottos = Prodotto.all

INSERT INTO `prodottos` (`nome`, `avversit`, `id_cat`, `created_at`, `updated_at`) VALUES ('DDT', 'gfdsgd', 1, '2018-01-19 18:08:06', '2018-01-19 18:08:06')
---
  def create
    @prodotto = Prodotto.new(prodotto_params)

    respond_to do |format|
      if @prodotto.save

UPDATE `prodottos` SET `avversit` = 'tutte', `updated_at` = '2018-01-22 23:40:17' WHERE `prodottos`.`id` = 1
---
  def update
    respond_to do |format|
      if @prodotto.update(prodotto_params)

SELECT  `prodottos`.* FROM `prodottos` WHERE `prodottos`.`id` = 2 LIMIT 1
---
    def set_prodotto
      @prodotto = Prodotto.find(params[:id])