app/controllers/prodotto_trattamentos_controller.rb

SELECT `prodotto_trattamentos`.* FROM `prodotto_trattamentos`
---
  def index
    @prodotto_trattamentos = ProdottoTrattamento.all

INSERT INTO `prodotto_trattamentos` (`id_prodotto`, `id_trattamento`, `dose_ha`, `avvesit`, `created_at`, `updated_at`) VALUES (1, 1, 5.5555555555555555e+22, 'ciao merda', '2018-01-19 18:22:07', '2018-01-19 18:22:07')
---
  def create
    @prodotto_trattamento = ProdottoTrattamento.new(prodotto_trattamento_params)

    respond_to do |format|
      if @prodotto_trattamento.save

DELETE FROM `prodotto_trattamentos` WHERE `prodotto_trattamentos`.`id` = 1
---
  def destroy
    @prodotto_trattamento.destroy

SELECT  `prodotto_trattamentos`.* FROM `prodotto_trattamentos` WHERE `prodotto_trattamentos`.`id` = 1 LIMIT 1
---
    def set_prodotto_trattamento
      @prodotto_trattamento = ProdottoTrattamento.find(params[:id])