app/controllers/trattamentos_controller.rb

SELECT `trattamentos`.* FROM `trattamentos`
---
  def index
    @trattamentos = Trattamento.all

INSERT INTO `trattamentos` (`data`, `id_coltura`, `id_attrezzo`, `avversit`, `semina`, `trapianto`, `fioritura`, `raccolta`, `created_at`, `updated_at`) VALUES ('2018-01-18', 1, 1, '', 1, 0, 0, 0, '2018-01-18 08:24:36', '2018-01-18 08:24:36')
---
  def create
    @trattamento = Trattamento.new(trattamento_params)

    respond_to do |format|
      if @trattamento.save

SELECT  `trattamentos`.* FROM `trattamentos` WHERE `trattamentos`.`id` = 3 LIMIT 1
---
    def set_trattamento
      @trattamento = Trattamento.find(params[:id])